In [1]:
# Import necessary libraries
import pandas as pd

#### Series and Dataframe
Series and dataframe are two important datatypes in pandas. We will build couple of seriese and build a dataframe using those.

In [2]:
# create 3 seriese
make = ["Mazda","Nissan","Mazda"]
model = ["CX-5","Rogue","CX-30"]
price = [19500, 40000, 32000]

In [3]:
# create dataframe using series
cars = pd.DataFrame({"make" : make, "model" : model, "price" : price})
cars

     make  model  price
0   Mazda   CX-5  19500
1  Nissan  Rogue  40000
2   Mazda  CX-30  32000

In [4]:
# Create dataframe from a CSV file
carsales = pd.read_csv("car-sales.csv")
carsales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

### Describe the Dataframe 
Use few functions and attributes to find information about the dataframe

In [6]:
# Data types of the columns or features of the dataframe

carsales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [7]:
# Get the column names of the dataframe
carcolumns = carsales.columns
print(carcolumns)

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [8]:
# Get the details of the index of the dataframe

carsales.index

RangeIndex(start=0, stop=10, step=1)

In [9]:
# Get the statistical info of the numeric columns or features of the dataframe

carsales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [10]:
# Get more details of each of the columns or features of the dataframe

carsales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [26]:
# Get how many rows and columns are there in the dataframe

carsales.shape

(10, 5)

In [27]:
# Get the record count based on value in a column

carsales['Make'].value_counts()

Make
Toyota    4
Honda     3
Nissan    2
BMW       1
Name: count, dtype: int64

In [29]:
# Get the record count based on value in multiple columns

carsales[['Make', 'Colour']].value_counts()

Make    Colour
Honda   Blue      2
Nissan  White     2
Toyota  White     2
BMW     Black     1
Honda   Red       1
Toyota  Blue      1
        Green     1
Name: count, dtype: int64

### View and select data in the dataframe

Use functions and attributes to select specific data in the dataframe

In [17]:
# Get the first 5 rows of the dataframe

carsales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [18]:
# Get the last 5 rows of the dataframe

carsales.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [22]:
# Get a specific row in the dataframe

carsales.iloc[4] # This will return the row having index value = 4

Make                Nissan
Colour               White
Odometer (KM)       213095
Doors                    4
Price            $3,500.00
Name: 4, dtype: object

In [23]:
# Get specific rows of the dataframe

carsales.iloc[2:4] # This will return the rows from the one having index value = 2 and upto the one having index value one less than 4

     Make Colour  Odometer (KM)  Doors       Price
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00

In [24]:
# Get a specific row from the tail end of the dataframe

carsales.iloc[-2] # This will return the row having index value = (total index, which is 10 - 2) = 8

Make                Toyota
Colour               White
Odometer (KM)        60000
Doors                    4
Price            $6,250.00
Name: 8, dtype: object

In [25]:
# Get the value of a specific cell in the dataframe

carsales.iloc[4]['Make'] # This will return the value of the Make column from the row having index value = 4

'Nissan'

In [30]:
# Filter data based on single criteria

carsales[carsales['Make'] == "Toyota"]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00

In [34]:
# Filter data based on multiple criteria

carsales[(carsales['Make'] == "Toyota") & (carsales['Odometer (KM)'] > 75000)]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
5  Toyota  Green          99213      4  $4,500.00

In [35]:
# Using groupby finction on a single column of the dataframe

carsales.groupby('Make')['Odometer (KM)'].mean()

Make
BMW        11179.000000
Honda      62778.333333
Nissan    122347.500000
Toyota     85451.250000
Name: Odometer (KM), dtype: float64

In [36]:
# Using groupby finction on multiple column of the dataframe

carsales.groupby(['Make', 'Colour'])['Odometer (KM)'].mean()

Make    Colour
BMW     Black      11179.0
Honda   Blue       50218.0
        Red        87899.0
Nissan  White     122347.5
Toyota  Blue       32549.0
        Green      99213.0
        White     105021.5
Name: Odometer (KM), dtype: float64

### Manipulating data in the dataframe

In [55]:
# Convert the Price column from object/string to integer

carsales['Price'] = carsales['Price'].str.replace('$', '').str.replace(',', '').str.replace('.00', '').astype('int64')
carsales['Price'].dtype

dtype('int64')

In [72]:
# Convert the value of specific cell to lowercase

carsales.iloc[0, 1] = carsales.iloc[0, 1].lower() # This will change the value of the 2nd column (Colour) of the 1st row from White to white
carsales.head()

     Make Colour  Odometer (KM)  Doors  Price
0  Toyota  white         150043      4   4000
1   Honda    Red          87899      4   5000
2  Toyota   Blue          32549      3   7000
3     BMW  Black          11179      5  22000
4  Nissan  White         213095      4   3500

In [75]:
# Filter dataframe for both upper and lower case

carsales[carsales['Colour'].str.lower() == 'white']

     Make Colour  Odometer (KM)  Doors  Price
0  Toyota  white         150043      4   4000
4  Nissan  White         213095      4   3500
8  Toyota  White          60000      4   6250
9  Nissan  White          31600      4   9700